[
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "walnut mochi",
    "entryTitle": "walnut mochi",
    "entryRating": "9/10",
    "entryComment": "The consistency is harder than most other Mochies, the nutty and sweet aftertaste of this with the slight walnut taste makes this incredible."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "TODO pink cookie",
    "entryTitle": "pink cookie",
    "entryRating": "9/10",
    "entryComment": "The taste was very Surprising, something i havent really tasted before. The consistency is a bit mushy which fits perfectly to the strawberry like flavor."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "TODO white chocolate fruits",
    "entryTitle": "white chocolate fruits",
    "entryRating": "6.7/10",
    "entryComment": "Dried apple infused with white chocolate? Sounds interesting and certainly is! It tastes mostly like white chocolate and has only a hint of apple flavor to it, as someone who doesnt really like white chocolate thats a bit sad."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "TODO squared thingy green",
    "entryTitle": "squared thingy green",
    "entryRating": "5/10",
    "entryComment": "Im actually not too sure what it is specifically, i didnt really taste too much of it, it maybe has a slight rice syrup taste but thats pretty much it, has also no real texture. very underwhelming."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "TODO above blue",
    "entryTitle": "a",
    "entryRating": "6/10",
    "entryComment": "Better than the green one but it tastes very peppery. The texture is very similar but it doesnt feel like im biting on something empty."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "Sesame cookie",
    "entryTitle": "Sesame cookie",
    "entryRating": "2.5/10",
    "entryComment": "Not a cookie, very hard and crunchy. No sweetness present and tastes EXTREMELY like black sesame. The taste is wayy too overpowering for my taste but for someone who loves black sesame thats a treat."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "Rice Tea",
    "entryTitle": "Rice Tea",
    "entryRating": "8.5/10",
    "entryComment": "Smells like childhood, if you have ever smelled rice crackers then you recognize this smell and taste instantly. Adding honey to it and it tastes exactly like eating rice crackers with agave syrup but as a drink. Maybe a bit too much for one person alone."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "TODO french snack thing",
    "entryTitle": "a",
    "entryRating": "8/10",
    "entryComment": "That kind of surprised me at first, as it looks exactly like french macarons but the outer part of it is like empty eating paper and inbetween is a jelly filling. It is increadibly sweet so i couldnt eat much of it but it tastes really good nontheless."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "TODO 2 face thing",
    "entryTitle": "a",
    "entryRating": "2/10",
    "entryComment": "Has zero taste, zero texture and vanished without me noticing. I am just confused."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "sweet potato pie",
    "entryTitle": "sweet potato pie",
    "entryRating": "9.8/10",
    "entryComment": "This tastes Incredible. The dough reminds me a bit of sourdough and its very moist, with the perfectly sweet sweetpotato pieces in there its just the perfect cake. I wish it would be a bigger piece!"
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "TODO toritama baum",
    "entryTitle": "toritama baum",
    "entryRating": "5/10",
    "entryComment": "It has a nice, mushy texture but after biting into it it feels more like eating powder. Generally a bland taste but somehow theres a weird aftertaste to it which i didnt like. Great potential but failed in the end."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "azukimonaka",
    "entryTitle": "azukimonaka",
    "entryRating": "8.5/10",
    "entryComment": "The outer shell reminds me of this thick eating paper, inside of it is a sweet paste which isn't a purée like consistency but still has some small pieces in there, i love it but there is something missing to it which i cannot quite tell."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "TODO miruku stick thing",
    "entryTitle": "a",
    "entryRating": "0/10",
    "entryComment": "Wasn't even able to open (or eat) it."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "TODO bland baumkuchen",
    "entryTitle": "a",
    "entryRating": "8/10",
    "entryComment": "Tasted like a good Baumkuchen with a bit of powdered sugar. Moist inside and slight vanillary aftertaste. A bit too dense to eat it as is but with something to drink it together its perfect."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "TODO squid thing",
    "entryTitle": "a",
    "entryRating": "5/10",
    "entryComment": "Increadible smell but thats the only increadible thing about it. The texture is like those dried bacon chips but theres no real flavor to it. Its like a rice cracker with squid arome, you only really taste something when eating alot of it which is more or less the whole thing."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "TODO yuzu shichimi nut thingies",
    "entryTitle": "a",
    "entryRating": "2.5/10",
    "entryComment": "I was expecting peanuts or something but thats defenitely not it. Its like a nut but hollow inside of it with a weird black sesam spiciness which i dont like."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "omikuji candy",
    "entryTitle": "omicuji candy",
    "entryRating": "8/10",
    "entryComment": "Traditional japanese luck games, exactly my kind of thing. Good sweet taste and funny sharing with others and discussing what would happen in the future."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "taiyaki",
    "entryTitle": "taiyaki",
    "entryRating": "8.5/10",
    "entryComment": "This one was kind of weird, the outside is very moist and mushy but you can clearly feel the harder inside, its like when slightly squeezing an eggplant. The bean paste in it has a really nice texture and taste and the parts where you get paste and dough is really good."
  },
  {
    "imgPath": "../images/Thumbnails/placeholder.png",
    "imgAlt": "a",
    "entryTitle": "a",
    "entryRating": "A/10",
    "entryComment": "a"
  }
]