[
  {
    "imgPath": "../images/youkai/abumi_guchi.jpg",
    "imgAlt": "abumi guchi",
    "entryTitle": "abumi guchi",
    "entryRating": "6/10",
    "entryComment": "abumi guchi are formed from a stirrup, usually one thats from a fallen soldier in battle. It has a furry appearence and it looks so dumb, i love it. Other than that pretty forgetable"
  },
  {
    "imgPath": "../images/youkai/abura_akago.webp",
    "imgAlt": "abura akago",
    "entryTitle": "abura akago",
    "entryRating": "7.5/10",
    "entryComment": "it appeared in the village of Shiga, where its origin is that there was an oil merchant that at night stole oil and after he died his soul manifested in abura akago. it looks like a ball of flame which enters houses, then transforms into a small kid and licks the oil out of lamps. The licking kid is a pretty funny thought to me."
  },  
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "TODO",
    "entryTitle": "TODO",
    "entryRating": "3/10",
    "entryComment": "Desc: it is said that those who steal oil should get punished for it and being reincarneted as a youkai. Boring story, nothing special about it, looks like a goblin alien."
  },
  {
    "imgPath": "../images/youkai/agubanba.jpg",
    "imgAlt": "agubanba",
    "entryTitle": "agubanba",
    "entryRating": "5/10",
    "entryComment": "didnt find much about this one in english, its name meaning ash crone, shes a blind, cannibalistic youkai who kills young girls (look up more of it)."
  },
  {
    "imgPath": "../images/youkai/akabeko.jpg",
    "imgAlt": "akabeko",
    "entryTitle": "akabeko",
    "entryRating": "8/10",
    "entryComment": "akabeko, a red cow which helped at the construction of enzō-ji, very intersting story and an interesting picture being it a red cow. The toy akabeko is a reconstruction of this exact cow (its a red cow statue which can bob its head up and down) which is also said to protect against smallpox. As its the origin of this legendary toy and has such an interesting story i grew to really like it."
  },
  {
    "imgPath": "../images/youkai/aka_manto.png",
    "imgAlt": "aka manto",
    "entryTitle": "aka manto",
    "entryRating": "9.5/10",
    "entryComment": "a spirit that appears at a toilet which asks you if you want red or blue toilet paper (or in other versions a cloak). When u answer either of them you get killed, red for being skinned alive, blue for strangulation, the only way to survive is to ignore or reject and flee. Such a badass legend, i love it."
  },
  {
    "imgPath": "../images/youkai/akaname.jpg",
    "imgAlt": "akaname",
    "entryTitle": "akaname",
    "entryRating": "2/10",
    "entryComment": "akaname whereas the aka stands for filth (sweat, dead skin cells, dirt, grime,...) is a youkai that LICKS dirty bathrooms and licks away all the scum. it looks like a human child with clawed feet and cropped head. absolutely disgust in my opinion but thanks for making them tidy i suppose?"
  },
  {
    "imgPath": "../images/youkai/akashita.jpg",
    "imgAlt": "akashita",
    "entryTitle": "akashita",
    "entryRating": "5/10",
    "entryComment": "it is depicted as a beast with clawed hands and a very hairy face covered with dark clouds, but its full body appearance is unknown, there is also a lot of debate about his true origin and meaning, one theory meaning \"as long as one's mouth is open, one will never be blessed with good fortune\". Interesting appearence as its unknown but other than that not really special, especially when you dont even know the real origin"
  },
  {
    "imgPath": "../images/youkai/akateko.jpg",
    "imgAlt": "Akateko",
    "entryTitle": "Akateko",
    "entryRating": "7/10",
    "entryComment": "A childs hand dangling down a Japanese honey locust tree, accompanied by a young girl (around 18) which in most legends is completly harmless and does nothing but scare people, in other legends it grabs people and rips them apart and other say its an illusion created by an kitsune or tanuki. I love the first one which just scares people because its so pointless funny and i can just imagine how scared id be knowing that story as a kid. the other legends however are wayy too basic for my good."
  },
  {
    "imgPath": "../images/youkai/akkorokamui.webp",
    "imgAlt": "Akkorokamui",
    "entryTitle": "Akkorokamui",
    "entryRating": "6/10",
    "entryComment": "Akkorokamui is a giant octopus living in uchiura bay and is basically just the japanese version of krakenXnessie, however the backstory is a bit more interesting, back then akkorokamui was a huge spider named Yaushikep which was feared by people. The watergod answered their prayers and banished Yaushikep into the water. It also happened to be in the movie and in an episode of Bob's burgers! Basic but the backstory makes it good."
  },
  {
    "imgPath": "../images/youkai/akubouzu.webp",
    "imgAlt": "Akubouzu",
    "entryTitle": "Akubouzu",
    "entryRating": "3/10",
    "entryComment": "Its said that they live in the ash of the hearth (irori, a kind of furnace) in Senboku-gun and Ogatsu-gun. As there are many other legends about youkai appearing in ashes and killing/eating people so this is just one of many more."
  },
  {
    "imgPath": "../images/youkai/akugyo.jpg",
    "imgAlt": "Akugyo",
    "entryTitle": "Akugyo",
    "entryRating": "6.5/10",
    "entryComment": "Akugyo are gigantic fishes that often have oni-like horns and some can even spit fire. They are capable of sinking whole ships and lodge them between their fins so they can eat the crewmates. In some stories its said that its about 11 meters long. In some other stories its said that they are sometimes gigantic Ningyo (cursed version of mermaids, if youve never heard of it, google it!) with gold and silver scales. Quite interesting tale"
  },
  {
    "imgPath": "../images/youkai/akurojin-no-hi.jpg",
    "imgAlt": "Akurojin-no-hi",
    "entryTitle": "Akurojin-no-hi",
    "entryRating": "5/10",
    "entryComment": "Now for this i couldnt find much at all. all i could find is, that its a ghostly fire which appears during rain and sickens people who dont run away. As more is unkown (at least to me) and its not even said how sick it makes people i cant accurately rate it."
  },
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "Amabie",
    "entryTitle": "Amabie",
    "entryRating": "3/10",
    "entryComment": "Amabie is said to be a mermaid or merman with a birds beak as its mouth and 3 legs/fins and it prophesies either an abundant harvest or an epidemic when appearing. It appears that the Amabie is just a misspelling of the pretty much same youkai amabiko. In my opinion that looks pretty dumb considering its probably just a misspelling of another youkai and it has no real unique trade except for the appearence."
  },
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "Amaburakosagi",
    "entryTitle": "Amaburakosagi",
    "entryRating": "X/10",
    "entryComment": "A version of Namahage located in Shikoku. I will not rate this as its just a later entry in a different reagion"
  },
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "Amamehagi",
    "entryTitle": "Amamehagi",
    "entryRating": "X/10",
    "entryComment": "A version of Namahage located in Shikoku. I will not rate this as its just a later entry in a different reagion"
  },
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "Amanojaku",
    "entryTitle": "Amanojaku",
    "entryRating": "8/10",
    "entryComment": "Amanojaku is a prehistoric, small oni which was noted even before the japanese writing system was even a thing. its able to provoke a person's darkest desires and it nature is very contrary, it does the exact opposite of what its told to do. It has an appearence in the fairytale Uriko-hime where it kills the girl and even uses her skin to impersonate her sometimes. Its also said that its derived from Amanozako, a deity from the Shintou mythology. The fact that its so so old and its nature i really like it, has a great potential."
  },
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "Amanozako",
    "entryTitle": "Amanozako",
    "entryRating": "2.5/10",
    "entryComment": "Amanozako is a monstrous goddess and its said that she originated when Susanoo let his own aramitama (the soul of a kitsune) build up until he vomited her out. She has a short tamper, a beastly head with a long nose, long ears, and fangs so strong they can chew metal blades and is capable of flying for a thousand li (chinese miles, around 500KM). She's very picky and does nothing what others expect and gets very mad when not getting what she wants. She has some unique and nice trades and manipulates people but shes basically a spoiled problemchild which makes me really dislike her. (And her birth is gross)"
  },
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "Amaterasu",
    "entryTitle": "Amaterasu",
    "entryRating": "TODO/10",
    "entryComment": "the sun goddess, one of the \"Three Precious Children\", sibling of the moon god and storm god is known all the way back from one of the first japanese writings. One of the most important gods in shintou religion. TODO SEARCH MORE"
  },
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "Amazake-babaa",
    "entryTitle": "Amazake-babaa",
    "entryRating": "7/10",
    "entryComment": "Its a old Woman who goes around and asks in a childish voice if she can have some amazake (a sweet sake) and whoever answers, no matter if they say yes or no, will fall ill. Nothing serious, only smallpox or the common cold. amazake-banbaa is a very similar youkai which goes around and asks if someone wants to buy amazake and again, if one answers they'll fall ill. what helps against amazake-banbaa is a sign \"we do not like sake or amazake\" on the front door. Funny story and pretty harmless as its not a very serious illness. So silly"
  },
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "Amefurikozō",
    "entryTitle": "Amefurikozō",
    "entryRating": "5/10",
    "entryComment": "it wears a Japanese umbrella with its central pole missing, and it is depicted possessing a paper lantern. In its original story its said that its a jidō (children employed by the nobility) of the Chinese god of rain \"Ushi\". It was also explained, that when you steal the umbrella you wouldnt be able to get it off again and that Amefurikozō controls the rain. Its basically a child in the rain controlling it, basic story, nothing special about it."
  },
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "Amemasu",
    "entryTitle": "Amemasu",
    "entryRating": "5/10",
    "entryComment": "Amemasu is a huge whale/fish creature from the ainu folklore. There are many of them spread in various lakes and its said to cause earthquakes, other natural disasters and of course also sinks boats. Its able to change into a human form (most of the times that of a beautiful woman) which lures young men into their deaths. they also have fish like skin when being in their human form. Basically NessieXmermaids."
  },
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "Ameonna",
    "entryTitle": "Ameonna",
    "entryRating": "5/10",
    "entryComment": "Ameonna is translated \"Rain Woman\" and as its name applies its calling forth rain. Ameonna/Ameotoko refers nowadays to a person thats jinxed to have rain follow them all the time. In a story its referring to a very similar yokai (even though the word youkai was never used so there isnt definitive proof), that she is clouds in the morning, and rain in the evening. Not that interesting of a story, pretty basic aswell."
  },
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "Amikiri",
    "entryTitle": "Amikiri",
    "entryRating": "5.5/10",
    "entryComment": "Thats a interesting looking Youkai here, it has a bird beak, arms from a lobster and destroys fisher nets and mosquito nets. Because of that its often seen as a pest. As far as ive seen it doesnt do much else besides that, funny idea but id give it less points if it would cut down my mosquito nets."
  },
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "Amoroonagu",
    "entryTitle": "Amoroonagu",
    "entryRating": "TODO/10",
    "entryComment": "She is a tennyo (a celestial maiden) which originates from the Kagoshima prefecture. The only thing i found out is, that she bathes in pools and waterfalls in ravines."
  },
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "Anmo",
    "entryTitle": "Anmo",
    "entryRating": "X/10",
    "entryComment": "A version of Namahage located in Iwate. I will not rate this as its just a later entry in a different reagion"
  },
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "Aoandon",
    "entryTitle": "Aoandon",
    "entryRating": "4/10",
    "entryComment": "Aoandon which has the name from the blue paper lanterns andon, is said to be the spirit which appears when playing Hyakumonogatari Kaidankai (a popular game back in the edo period) and it came to the last story. It looks like a woman with blueish skin, two horns and sharp teeth"
  },
  {
    "imgPath": "../images/youkai/placeholder.png",
    "imgAlt": "aaa",
    "entryTitle": "ddd",
    "entryRating": "X/10",
    "entryComment": "desc"
  }
]


